app/controllers/home_controller.rb

  def about
    @page_title = 'about'
    @current_committee = CurrentCommittee.select("name, description, image")
---
SELECT name, description, image FROM `current_committees`
SELECT year, position, name FROM `committees`

  def events
    @page_title = 'events'
    @events = Event.select("name, description, image")
---
SELECT name, description, image FROM `events`